src/uprop.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
#+TITLE:       free42 Uncertainty Propagation
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2021-04-30
#+DESCRIPTION: Some simple math stuff for free42
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://richmit.github.io/hp42/
#+EXPORT_FILE_NAME: ../docs/uprop

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|          <r> | <l>                                          |
|    *Author:* | /{{{author}}}/                               |
|   *Updated:* | /{{{modification-time(%Y-%m-%d %H:%M:%S)}}}/ |
#+ATTR_HTML: :align center
Copyright {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#   00   #    10   #    20   #    30   #    40   #    50   #    60   #    70   #    80   #    90   #   100   #   110   #   120   #   130   #   140   #   150   #   160   #
# 234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #

* Metadata

The home for this HTML file is: https://richmit.github.io/hp42/uprop.html

Files related to this document may be found on github: https://github.com/richmit/hp42

Directory contents:
#+ATTR_HTML: :border 0 :frame none :rules none :align center
   | =src=     | - | The org-mode file that generated this HTML document            |
   | =src_42s= | - | Ready to convert source listings for 42s code in this document |
   | =docs=    | - | This html document                                             |
   | =bin=     | - | Importable RAW program files                                   |

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

This org-mode file contains a program, =UPROP=, that can be used to preform calculations that propagate uncertainty using the standard Gaussian model.  Values
are represented as complex numbers with the imaginary part being the standard deviation.  i.e.  V+iU means the value is V and the uncertainty is represented by
U (a standard deviation).

* Menu
:PROPERTIES:
:CUSTOM_ID: menu-uprop
:END:

#+ATTR_HTML: :align center :frame box :rules all
#+NAME:UPROP
| Menu  | LBL    | Value      | Uncertainty (Standard Deviation)             | Notes           |
|-------+--------+------------+----------------------------------------------+-----------------|
| +     | U+     | Y.v+X.v    | HYPOT(X.u, Y.u)                              |                 |
| -     | U-     | Y.v-X.v    | HYPOT(X.u, Y.u)                              |                 |
| ×     | U×     | Y.v*X.v    | ABS(X.v*Y.v)*HYPOT(X.u/X.v, Y.u/Y.v)         |                 |
| ÷     | U÷     | Y.v/X.v    | ABS(X.v/Y.v)*HYPOT(X.u/X.v, Y.u/Y.v)         |                 |
| Y↑X   | UY↑X   | Y.v^X.v    | ABS(Y.v^X.v)*HYPOT(Y.u*X.v/Y.v, LN(Y.v)*X.u) |                 |
| 1/X   | U1/X   | 1/X.v      | ABS(X.u)                                     |                 |
|-------+--------+------------+----------------------------------------------+-----------------|
| ▒▒▒▒  |        |            |                                              |                 |
| LN    | ULN    | LN(X.v)    | ABS(X.u/X.v)                                 |                 |
| E↑X   | UE↑X   | EXP(X.v)   | EXP(X.v)*ABS(X.u*X.v)                        |                 |
| ▒▒▒▒  |        |            |                                              |                 |
| GAM   | UGAMMA | GAMMA(X.v) | ABS(DIGAMMA(X.v)*GAMMA(X.v)*X.u)             | Requires [[file:sfun.org][=SFUN=]] |
| ▒▒▒▒  |        |            |                                              |                 |
|-------+--------+------------+----------------------------------------------+-----------------|
| SIN   | USIN   | SIN(X.v)   | ABS(COS(X.v)*X.u)                            |                 |
| COS   | UCOS   | COS(X.v)   | ABS(SIN(X.v)*X.u)                            |                 |
| TAN   | UTAN   | TAN(X.v)   | ABS(SEC^2(X.v)*X.u)                          |                 |
| ASIN  | UASIN  | ASIN(X.v)  | ABS(X.u/SQRT(1-X.v^2))                       |                 |
| ACOS  | UACOS  | ACOS(X.v)  | ABS(X.u/SQRT(1-X.v^2))                       |                 |
| ATAN  | UATAN  | ATAN(X.v)  | ABS(X.u/(1+X.v^2))                           |                 |
|-------+--------+------------+----------------------------------------------+-----------------|
| SINH  | USINH  | SINH(X.v)  | ABS(COSH(X.v)*X.u)                           |                 |
| COSH  | UCOSH  | COSH(X.v)  | ABS(SINH(X.v)*X.u)                           |                 |
| TANH  | UTANH  | TANH(X.v)  | ABS(SECH^2(X.v)*X.u)                         |                 |
| ASINH | UASINH | ASINH(X.v) | ABS(X.u/SQRT(1-X.v^2))                       |                 |
| ACOSH | UACOSH | ACOSH(X.v) | ABS(X.u/SQRT(1-X.v^2))                       |                 |
| ATANH | UATANH | ATANH(X.v) | ABS(X.u/(1+X.v^2))                           |                 |

