docs/uprop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-01 Sat 13:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42 Uncertainty Propagation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Some simple math stuff for free42"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42 Uncertainty Propagation</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-05-01 12:21:43</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org01236e3">1. Metadata</a></li>
<li><a href="#introduction">2. Introduction</a></li>
<li><a href="#menu-uprop">3. Menu</a></li>
<li><a href="#org9e534ac">4. Menu Code</a></li>
<li><a href="#org4969e43">5. Functions</a></li>
</ul>
</div>
</div>

<div id="outline-container-org01236e3" class="outline-2">
<h2 id="org01236e3"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
The home for this HTML file is: <a href="https://richmit.github.io/hp42/uprop.html">https://richmit.github.io/hp42/uprop.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<p>
Directory contents:
</p>
<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>src</code></td>
<td class="org-left">-</td>
<td class="org-left">The org-mode file that generated this HTML document</td>
</tr>

<tr>
<td class="org-left"><code>src_42s</code></td>
<td class="org-left">-</td>
<td class="org-left">Ready to convert source listings for 42s code in this document</td>
</tr>

<tr>
<td class="org-left"><code>docs</code></td>
<td class="org-left">-</td>
<td class="org-left">This html document</td>
</tr>

<tr>
<td class="org-left"><code>bin</code></td>
<td class="org-left">-</td>
<td class="org-left">Importable RAW program files</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
This org-mode file contains a program, <code>UPROP</code>, that can be used to preform calculations that propagate uncertainty using the standard Gaussian model.  Values
are represented as complex numbers with the imaginary part being the standard deviation.  i.e.  V+iU means the value is V and the uncertainty is represented by
U (a standard deviation).
</p>
</div>
</div>

<div id="outline-container-menu-uprop" class="outline-2">
<h2 id="menu-uprop"><span class="section-number-2">3</span> Menu</h2>
<div class="outline-text-2" id="text-menu-uprop">
<table id="org5463479" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">LBL</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Uncertainty (Standard Deviation)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">U+</td>
<td class="org-left">Y.v+X.v</td>
<td class="org-left">HYPOT(X.u, Y.u)</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">U-</td>
<td class="org-left">Y.v-X.v</td>
<td class="org-left">HYPOT(X.u, Y.u)</td>
</tr>

<tr>
<td class="org-left">×</td>
<td class="org-left">U×</td>
<td class="org-left">Y.v*X.v</td>
<td class="org-left">ABS(X.v*Y.v)*HYPOT(X.u/X.v, Y.u/Y.v)</td>
</tr>

<tr>
<td class="org-left">÷</td>
<td class="org-left">U÷</td>
<td class="org-left">Y.v/X.v</td>
<td class="org-left">ABS(X.v/Y.v)*HYPOT(X.u/X.v, Y.u/Y.v)</td>
</tr>

<tr>
<td class="org-left">Y↑X</td>
<td class="org-left">UY↑X</td>
<td class="org-left">Y.v^X.v</td>
<td class="org-left">ABS(Y.v^X.v)*HYPOT(Y.u*X.v/Y.v, LN(Y.v)*X.u)</td>
</tr>

<tr>
<td class="org-left">1/X</td>
<td class="org-left">U1/X</td>
<td class="org-left">1/X.v</td>
<td class="org-left">ABS(X.u)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">LN</td>
<td class="org-left">ULN</td>
<td class="org-left">LN(X.v)</td>
<td class="org-left">ABS(X.u/X.v)</td>
</tr>

<tr>
<td class="org-left">E↑X</td>
<td class="org-left">UE↑X</td>
<td class="org-left">EXP(X.v)</td>
<td class="org-left">EXP(X.v)*ABS(X.u*X.v)</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SIN</td>
<td class="org-left">USIN</td>
<td class="org-left">SIN(X.v)</td>
<td class="org-left">ABS(COS(X.v)*X.u)</td>
</tr>

<tr>
<td class="org-left">COS</td>
<td class="org-left">UCOS</td>
<td class="org-left">COS(X.v)</td>
<td class="org-left">ABS(SIN(X.v)*X.u)</td>
</tr>

<tr>
<td class="org-left">TAN</td>
<td class="org-left">UTAN</td>
<td class="org-left">TAN(X.v)</td>
<td class="org-left">ABS(SEC^2(X.v)*X.u)</td>
</tr>

<tr>
<td class="org-left">ASIN</td>
<td class="org-left">UASIN</td>
<td class="org-left">ASIN(X.v)</td>
<td class="org-left">ABS(X.u/SQRT(1-X.v^2))</td>
</tr>

<tr>
<td class="org-left">ACOS</td>
<td class="org-left">UACOS</td>
<td class="org-left">ACOS(X.v)</td>
<td class="org-left">ABS(X.u/SQRT(1-X.v^2))</td>
</tr>

<tr>
<td class="org-left">ATAN</td>
<td class="org-left">UATAN</td>
<td class="org-left">ATAN(X.v)</td>
<td class="org-left">ABS(X.u/(1+X.v^2))</td>
</tr>
</tbody>
</table>
</div>
</div>
