src/uprop.org
* Menu Code

#+BEGIN_SRC elisp :var tbl=UPROP :colnames y :results output verbatum :wrap "src hp42s :eval never :tangle ../src_42s/uprop/uprop.hp42s"
(MJR-generate-42-menu-code "UPROP" 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :eval never :tangle ../src_42s/uprop/uprop.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:UPROP)
@@@@ DSC: Auto-generated menu program
LBL "UPROP"
LBL 01            @@@@ Page 1 of menu UPROP
CLMENU
"+"
KEY 1 XEQ "U+"
"-"
KEY 2 XEQ "U-"
"×"
KEY 3 XEQ "U×"
"÷"
KEY 4 XEQ "U÷"
"Y↑X"
KEY 5 XEQ "UY↑X"
"1/X"
KEY 6 XEQ "U1/X"
KEY 7 GTO 04
KEY 8 GTO 02
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 02            @@@@ Page 2 of menu UPROP
CLMENU
"LN"
KEY 2 XEQ "ULN"
"E↑X"
KEY 3 XEQ "UE↑X"
"GAM"
KEY 5 XEQ "UGAMMA"
KEY 7 GTO 01
KEY 8 GTO 03
KEY 9 GTO 00
MENU
STOP
GTO 02
LBL 03            @@@@ Page 3 of menu UPROP
CLMENU
"SIN"
KEY 1 XEQ "USIN"
"COS"
KEY 2 XEQ "UCOS"
"TAN"
KEY 3 XEQ "UTAN"
"ASIN"
KEY 4 XEQ "UASIN"
"ACOS"
KEY 5 XEQ "UACOS"
"ATAN"
KEY 6 XEQ "UATAN"
KEY 7 GTO 02
KEY 8 GTO 04
KEY 9 GTO 00
MENU
STOP
GTO 03
LBL 04            @@@@ Page 4 of menu UPROP
CLMENU
"SINH"
KEY 1 XEQ "USINH"
"COSH"
KEY 2 XEQ "UCOSH"
"TANH"
KEY 3 XEQ "UTANH"
"ASINH"
KEY 4 XEQ "UASINH"
"ACOSH"
KEY 5 XEQ "UACOSH"
"ATANH"
KEY 6 XEQ "UATANH"
KEY 7 GTO 03
KEY 8 GTO 01
KEY 9 GTO 00
MENU
STOP
GTO 04
LBL 00 @@@@ Application Exit
EXITALL
RTN
@@@@ Free labels start at: 5
#+end_src

