docs/uprop.html

<div id="outline-container-org9e534ac" class="outline-2">
<h2 id="org9e534ac"><span class="section-number-2">4</span> Menu Code</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"UPROP"</span> 0 tbl 0 1 'stay 'up #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-UPROP" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (UPROP)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"UPROP"</span>
<span style="color: #00ffff;">LBL</span> 01            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu UPROP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"+"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"U+"</span>
<span style="color: #fa8072;">"-"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"U-"</span>
<span style="color: #fa8072;">"&#215;"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"U&#215;"</span>
<span style="color: #fa8072;">"&#247;"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"U&#247;"</span>
<span style="color: #fa8072;">"Y&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UY&#8593;X"</span>
<span style="color: #fa8072;">"1/X"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"U1/X"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu UPROP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"LN"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"ULN"</span>
<span style="color: #fa8072;">"E&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UE&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 03            <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 3 of menu UPROP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"SIN"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"USIN"</span>
<span style="color: #fa8072;">"COS"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UCOS"</span>
<span style="color: #fa8072;">"TAN"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UTAN"</span>
<span style="color: #fa8072;">"ASIN"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UASIN"</span>
<span style="color: #fa8072;">"ACOS"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UACOS"</span>
<span style="color: #fa8072;">"ATAN"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #fa8072;">"UATAN"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">LBL</span> 00 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Free labels start at: 4</span>
</pre>
</div>
</div>
</div>
